<?php

$questions = [
    [
        "id" => "1",
        "question" => "Что представляет собой резьба?",
            "answers" => [
            "1.Расстояние между двумя соответствующими точками соседних витков." => false,
            "2.Линейная величина в осевом направлении при полном обороте стержня." => false,
            "3.Совокупность выступов и впадин, выполненных по винтовой линии на цилиндрической или конической поверхностях." => true,
        ]
    ],
    [
        "id" => "2",
        "question" => "На каком рисунке изображена резьба?",
        "img" => "/img/vopr1.png",
        "answers" => [
            "1" => false,
            "2" => true,
            "3" => false,
        ]
    ],
    [
        "id" => "3",
        "question" => "На каком рисунке изображена внутренняя резьба?",
        "img" => "/img/vopr2-3.png",
        "answers" => [
            "1" => true,
            "2" => false,
            "3" => false,   
        ]
    ],
    [
        "id" => "4",
        "question" => "На каком рисунке изображена наружная резьба?",
        "img" => "/img/vopr2-3.png",
        "answers" => [
            "1" => false,
            "2" => false,
            "3" => true, 
        ]
    ],
    [
        "id" => "5",
        "question" => "Какой тип резьбы в Tr20х4",
            "answers" => [
            "Метрическая" => false,
            "Трубная" => false,
            "Круглая" => false,
            "Трапецеидальная" => true,
            "Упорная" => false,
            "Прямоугольная" => false,
            "Дюймовая" => false,
        ]
    ],
    [
        "id" => "6",
       "question" => "Какой тип резьбы в S40х2",
            "answers" => [
            "Метрическая" => false,
            "Трубная" => false,
            "Круглая" => false,
            "Трапецеидальная" => false,
            "Упорная" => true,
            "Прямоугольная" => false,
            "Дюймовая" => false,
        ]
    ],
    [
        "id" => "7",
        "question" => "Какой тип резьбы в MK18",
            "answers" => [
            "Метрическая" => true,
            "Трубная" => false,
            "Круглая" => false,
            "Трапецеидальная" => false,
            "Упорная" => false,
            "Прямоугольная" => false,
            "Дюймовая" => false,
        ]
    ],
    [
        "id" => "8",
        "question" => "Какой тип резьбы в G1",
            "answers" => [
            "Метрическая" => false,
            "Трубная" => true,
            "Круглая" => false,
            "Трапецеидальная" => false,
            "Упорная" => false,
            "Прямоугольная" => false,
            "Дюймовая" => false,
        ]
    ],
    [
        "id" => "9",
        "question" => "Определите число заходов у резьбы, обозначенной S18x3(P1.5)",
        "answers" => [
            "Одно" => false,
            "Два" => true,
            "Три" => false,
        ]
    ],
    [
        "id" => "10",
        "question" => "Определите шаг у резьбы, обозначенной М28х2",
         "answers" => [
            "Мелкий" => true,
            "Крупный" => false,
          
        ]
    ],
    [
        "id" => "11",
        "question" => "Определите число заходов у резьбы, обозначенной S18x3(P1.5)",
        "answers" => [
            "Одно" => true,
            "Два" => false,
            "Три" => false,
        ]
    ],
];