<?php

$questions = [
    [
        "id" => "1",
        "question" => "Какой длины следует наносить штрихи линии 5?",
        "img" => "/img/3.png",
        "answers" => [
            "2-8" => true,
            "5-30" => false,
            "8-20" => false,
        ]
    ],
    [
        "id" => "2",
        "question" => "Какую длину имеют штрихи разомкнутой линии 1?",
        "img" => "/img/3.png",
        "answers" => [
            "2-8" => false,
            "5-30" => false,
            "8-20" => true,
        ]
    ],
    [
        "id" => "3",
        "question" => "Можно ли на одном и том же чертеже проводить линии видимого контура разной толщины?",
        "answers" => [
            "Да" => false,
            "Нет" => true,
        ]
    ],
    [
        "id" => "4",
        "question" => "Какое расстояние нужно брать между штрихами в линии 2",
        "img" => "/img/3.png",
        "answers" => [
            "3-5" => true,
            "1-2" => false,
        ]
    ],
    [
        "id" => "5",
        "question" => "Какое расстояние нужно брать между штрихами в линии 5",
        "img" => "/img/3.png",
        "answers" => [
            "3-5" => false,
            "1-2" => true,
        ]
    ],
    [
        "id" => "6",
        "question" => "В соответствии с правилами какого ГОСТа используются масштабы изображений детали и их обозначение на чертежах?",
        "answers" => [
            "ГОСТ 2.301-68" => false,
            "ГОСТ 2.302-68" => false,
            "ГОСТ 2.303-68" => true,

        ]
    ],
    [
        "id" => "7",
        "question" => "Какой из указанных масштабов является масштабом уменьшения?",
        "answers" => [
            "М 1:2" => true,
            "М 2:1" => false,
        ]
    ],
    [
        "id" => "8",
        "question" => "Укажите размеры основного формата?",
        "answers" => [
            "297х420" => true,
            "294х631" => false,
        ]
    ],
    [
        "id" => "9",
        "question" => "На каком формате основная надпись размещается только вдоль короткой стороны?",
        "answers" => [
            "A2" => false,
            "A3" => false,
            "A4" => true,
        ]
    ],
    [
        "id" => "10",
        "question" => "На каком из чертежей правильно проведена осевая линия?",
        "img" => "/img/1.png",
        "answers" => [
            "1" => false,
            "2" => true,
            "3" => false,
        ]
    ]
];
